AntoineMugnier/mutekh/arch/cc26xx/include/arch/cc26xx/memory_map.h

#ifndef _CC26XX_MAP_H_
#define _CC26XX_MAP_H_

#define CC26XX_SSI0_ADDR 0x40000000
#define CC26XX_UART0_ADDR 0x40001000
#define CC26XX_I2C0_ADDR 0x40002000
#define CC26XX_SSI1_ADDR 0x40008000
#define CC26XX_GPT0_ADDR 0x40010000
#define CC26XX_GPT1_ADDR 0x40011000
#define CC26XX_GPT2_ADDR 0x40012000
#define CC26XX_GPT3_ADDR 0x40013000
#define CC26XX_UDMA0_ADDR 0x40020000
#define CC26XX_I2S0_ADDR 0x40021000
#define CC26XX_GPIO_ADDR 0x40022000
#define CC26XX_CRYPTO_ADDR 0x40024000
#define CC26XX_TRNG_ADDR 0x40028000
#define CC26XX_FLASH_ADDR 0x40030000
#define CC26XX_VIMS_ADDR 0x40034000
#define CC26XX_RFC_PWR_ADDR 0x40040000
#define CC26XX_RFC_DBELL_ADDR 0x40041000
#define CC26XX_RFC_RAT_ADDR 0x40043000
#define CC26XX_WDT_ADDR 0x40080000
#define CC26XX_IOC_ADDR 0x40081000
#define CC26XX_PRCM_ADDR 0x40082000
#define CC26XX_EVENT_ADDR 0x40083000
#define CC26XX_SMPH_ADDR 0x40084000
#define CC26XX_SPIS_ADDR 0x40085000
#define CC26XX_ADI2_ADDR 0x40086000
#define CC26XX_ADI3_ADDR 0x40086200
#define CC26XX_AON_SYSCTL_ADDR 0x40090000
#define CC26XX_AON_WUC_ADDR 0x40091000
#define CC26XX_AON_RTC_ADDR 0x40092000
#define CC26XX_AON_EVENT_ADDR 0x40093000
#define CC26XX_AON_IOC_ADDR 0x40094000
#define CC26XX_AON_BATMON_ADDR 0x40095000
#define CC26XX_AUX_AIODIO0_ADDR 0x400C1000
#define CC26XX_AUX_AIODIO1_ADDR 0x400C2000
#define CC26XX_AUX_TDCIF_ADDR 0x400C4000
#define CC26XX_AUX_EVCTL_ADDR 0x400C5000
#define CC26XX_AUX_WUC_ADDR 0x400C6000
#define CC26XX_AUX_TIMER_ADDR 0x400C7000
#define CC26XX_AUX_SMPH_ADDR 0x400C8000
#define CC26XX_AUX_ANAIF_ADDR 0x400C9000
#define CC26XX_AUX_DDI0_OSC_ADDR 0x400CA000
#define CC26XX_AUX_ADI4_ADDR 0x400CB000
#define CC26XX_AUX_SCE_ADDR 0x400E1000
#define CC26XX_CPU_ITM_ADDR 0xE0000000
#define CC26XX_CPU_DWT_ADDR 0xE0001000
#define CC26XX_CPU_FPB_ADDR 0xE0002000
#define CC26XX_CPU_SCS_ADDR 0xE000E000
#define CC26XX_CPU_TPIU_ADDR 0xE0040000
#define CC26XX_CPU_TIPROP_ADDR 0xE00FE000

#endif

